Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/fedora-tm.tmx
Source language: en
Languages: ca_es

source: Indicates what is the syntax of the config file. SSSD 0.6.0 and later use version 2.
ca_es: Indica quina és la sintaxi de l'arxiu de configuració. L'SSSD 0.6.0 i posteriors fan servir la versió 2.

source: Comma separated list of services that are started when sssd itself starts.
ca_es: Llista de serveis separats per comes que s'inicien quan s'inicia el propi sssd.

source: reconnection_retries (integer)
ca_es: reconnection_retries (Enter)

source: Number of times services should attempt to reconnect in the event of a Data Provider crash or restart before they give up
ca_es: Nombre de vegades que els serveis haurien d'intentar reconnectar en cas de caiguda del Proveïdor de Dades o reiniciar abans de donar-se per vençuts

source: Default: 3
ca_es: Per defecte: 3

source: domains
ca_es: dominis

source: re_expression (string)
ca_es: re_expression (cadena)

source: full_name_format (string)
ca_es: full_name_format (cadena)

source: try_inotify (boolean)
ca_es: try_inotify (booleà)

source: SSSD monitors the state of resolv.conf to identify when it needs to update its internal DNS resolver. By default, we will attempt to use inotify for this, and will fall back to polling resolv.conf every five seconds if inotify cannot be used.
ca_es: L'SSSD controla l'estat de resolv.conf per a identificar quan cal actualitzar el seu traductor intern de DNS. Per defecte, s'intentarà utilitzar inotify per a això i recaurà en sondejar el resolv.conf cada cinc segons si inotify no es pot utilitzar.

source: There are some limited situations where it is preferred that we should skip even trying to use inotify. In these rare cases, this option should be set to 'false'
ca_es: Hi ha algunes situacions limitades on és preferit ometre fins i tot d'intentar utilitzar inotify. En aquests casos rars, s'hauria d'establir aquesta opció a 'false'

source: Default: true on platforms where inotify is supported. False on other platforms.
ca_es: Per defecte: true en plataformes on està suportat inotify. Fals en altres plataformes.

source: Note: this option will have no effect on platforms where inotify is unavailable. On these platforms, polling will always be used.
ca_es: Nota: aquesta opció no afectarà a plataformes on inotify no està disponible. En aquestes plataformes, sempre s'utilitzarà el sondeig.

source: Individual pieces of SSSD functionality are provided by special SSSD services that are started and stopped together with SSSD. The services are managed by a special service frequently called <quote>monitor</quote>. The <quote>[sssd]</quote> section is used to configure the monitor as well as some other important options like the identity domains. <placeholder type="variablelist" id="0"/>
ca_es: Parts concretes de la funcionalitat de l'SSSD les proveeixen serveis especials que s'inicien i s'aturen juntament amb l'SSSD. Els serveis es gestionen amb un servei especial anomenat <quote>monitor</quote>. La secció <quote>[sssd]</quote> s'utilitza per configurar el monitor així com altres opcions importants com les identitats de dominies. <placeholder type="variablelist" id="0"/>

source: SERVICES SECTIONS
ca_es: SECCIONS DE SERVEIS

source: Settings that can be used to configure different services are described in this section. They should reside in the [<replaceable>$NAME</replaceable>] section, for example, for NSS service, the section would be <quote>[nss]</quote>
ca_es: Ajustos que es poden utilitzar per configurar diferents serveis que es descriuen en aquesta secció. Han de residir a la secció [<replaceable>$Nom</replaceable>], per exemple, per a servei NSS, la secció seria <quote>[nss]</quote>

source: General service configuration options
ca_es: Opcions de configuració del servei general

source: These options can be used to configure any service.
ca_es: Aquestes opcions es poden utilitzar per a configurar qualsevol servei.

source: debug_level (integer)
ca_es: debug_level (Enter)

source: Add a timestamp to the debug messages
ca_es: Afegir una marca de temps als missatges de depuració

source: Default: true
ca_es: Per defecte: true

source: Default: false
ca_es: Per defecte: false

source: timeout (integer)
ca_es: timeout (Enter)

source: Default: 10
ca_es: Per defecte: 10

source: Default: 60
ca_es: Per defecte: 60

source: NSS configuration options
ca_es: Opcions de configuració d'NSS

source: These options can be used to configure the Name Service Switch (NSS) service.
ca_es: Aquestes opcions es poden utilitzar per a configurar el servei de canvi de servei de nom (NSS).

source: enum_cache_timeout (integer)
ca_es: enum_cache_timeout (Enter)

source: How many seconds should nss_sss cache enumerations (requests for info about all users)
ca_es: El número de segons que nss_sss emmagatzema a la meòria cau les enumeracions (peticions d'informació sobre tots els usuaris)

source: Default: 120
ca_es: Per defecte: 120

source: entry_cache_nowait_percentage (integer)
ca_es: entry_cache_nowait_percentage (Enter)

source: The entry cache can be set to automatically update entries in the background if they are requested beyond a percentage of the entry_cache_timeout value for the domain.
ca_es: El valor de la memòria cau es pot establir per actualitzar a automàticament les entrades en rerefons, si se sol·liciten més enllà d'un percentatge del valor entry_cache_timeout per al domini.

source: For example, if the domain's entry_cache_timeout is set to 30s and entry_cache_nowait_percentage is set to 50 (percent), entries that come in after 15 seconds past the last cache update will be returned immediately, but the SSSD will go and update the cache on its own, so that future requests will not need to block waiting for a cache update.
ca_es: Per exemple, si s'estableix entry_cache_timeout del domini a 30s i entry_cache_nowait_percentage està establert a 50 (per cent), les entrades que arriben després de 15 segons més enllà de l'última actualització de la memòria cau es retornaran immediatament, però l'SSSD anirà actualitzant la memòria cau pel seu propi compte, de manera que no caldrà bloquejar les peticions que esperen per a una actualització de la memòria cau.

source: Valid values for this option are 0-99 and represent a percentage of the entry_cache_timeout for each domain. For performance reasons, this percentage will never reduce the nowait timeout to less than 10 seconds. (0 disables this feature)
ca_es: Els valors vàlids per a aquesta opció són 0-99 i representen un percentatge de la entry_cache_timeout per a cada domini. Per raons de rendiment, aquest percentatge mai reduirà el temps d'espera de nowait a menys de 10 segons. (0 desactiva aquesta característica)

source: entry_negative_timeout (integer)
ca_es: entry_negative_timeout (Enter)

source: Specifies for how many seconds nss_sss should cache negative cache hits (that is, queries for invalid database entries, like nonexistent ones) before asking the back end again.
ca_es: Especifica quants segons nss_sss hauria d'emmagatzemar els intents de la memòria cau negatius (és a dir, consultes per a les entrades incorrectes de la base de dades, com les inexistents) abans de preguntar al rerefons una altra vegada.

source: Default: 15
ca_es: Per defecte: 15

source: filter_users, filter_groups (string)
ca_es: filter_users, filter_groups (cadena)

source: Default: root
ca_es: Per defecte: root

source: filter_users_in_groups (bool)
ca_es: filter_users_in_groups (booleà)

source: If you want filtered user still be group members set this option to false.
ca_es: Si voleu que els usuaris filtrats encara siguin membres del grup establiu aquesta opció a false.

source: Default: 300
ca_es: Per defecte: 300

source: PAM configuration options
ca_es: Opcions de configuració de PAM

source: These options can be used to configure the Pluggable Authentication Module (PAM) service.
ca_es: Aquestes opcions s'utilitzen per configurar el servei de Pluggable Authentication Module (PAM).

source: offline_credentials_expiration (integer)
ca_es: offline_credentials_expiration (Enter)

source: If the authentication provider is offline, how long should we allow cached logins (in days since the last successful online login).
ca_es: Si el proveïdor d'autenticació està fora de línia, quant de temps s'haurien de permetre inicis de sessió de la memòria cau (en dies des de l'últim inici de sessió).

source: Default: 0 (No limit)
ca_es: Per defecte: 0 (sense límit)

source: offline_failed_login_attempts (integer)
ca_es: offline_failed_login_attempts (Enter)

source: If the authentication provider is offline, how many failed login attempts are allowed.
ca_es: Si el proveïdor d'autenticació està fora de línia, quants intents d'accés fallits es permet.

source: offline_failed_login_delay (integer)
ca_es: offline_failed_login_delay (Enter)

source: The time in minutes which has to pass after offline_failed_login_attempts has been reached before a new login attempt is possible.
ca_es: El temps en minuts que ha de passar després que s'ha assolit offline_failed_login_attempts abans que un nou intent de connexió sigui possible.

source: Default: 5
ca_es: Per defecte: 5

source: pam_verbosity (integer)
ca_es: pam_verbosity (Enter)

source: Controls what kind of messages are shown to the user during authentication. The higher the number to more messages are displayed.
ca_es: Controla quin tipus de missatges es mostren a l'usuari durant la autenticació. Com més gran sigui el nombre més missatges es mostren.

source: Currently sssd supports the following values:
ca_es: L'Sssd suporta actualment els següents valors:

source: <emphasis>0</emphasis>: do not show any message
ca_es: <emphasis>0</emphasis>: no mostris cap missatge

source: <emphasis>1</emphasis>: show only important messages
ca_es: <emphasis>1</emphasis>: Mostra només missatges importants

source: <emphasis>2</emphasis>: show informational messages
ca_es: <emphasis>2</emphasis>: Mostra missatges informatius

source: <emphasis>3</emphasis>: show all messages and debug information
ca_es: <emphasis>3</emphasis>: Mostra tots els missatges i informació de depuració

source: Default: 1
ca_es: Per defecte: 1

source: pam_id_timeout (integer)
ca_es: pam_id_timeout (Enter)

source: For any PAM request while SSSD is online, the SSSD will attempt to immediately update the cached identity information for the user in order to ensure that authentication takes place with the latest information.
ca_es: Per a qualsevol petició de PAM mentre és en línia, l'SSSD intentarà actualitzar immediatament la informació d'identitat en memòria cau per a l'usuari per tal de garantir que l'autenticació es porta a terme amb l'última informació.

source: A complete PAM conversation may perform multiple PAM requests, such as account management and session opening. This option controls (on a per-client-application basis) how long (in seconds) we can cache the identity information to avoid excessive round-trips to the identity provider.
ca_es: Una conversa completa de PAM pot realitzar múltiples peticions de PAM, com ara la gestió del compte i la sessió d'inici. Aquesta opció controla (en base a aplicació per client) quant de temps (en segons) es pot emmagatzemar en memòria cau la informació d'identitat per evitar excessives peticions al proveïdor d'identitat.

source: Default: 0
ca_es: Per defecte: 0

source: DOMAIN SECTIONS
ca_es: SECCIONS DE DOMINI

source: min_id,max_id (integer)
ca_es: min_id, max_id (Enter)

source: UID and GID limits for the domain. If a domain contains an entry that is outside these limits, it is ignored.
ca_es: Els límits UID i GID per al domini. Si un domini conté una entrada que està fora d'aquests límits, s'ignora.

source: For users, this affects the primary GID limit. The user will not be returned to NSS if either the UID or the primary GID is outside the range. For non-primary group memberships, those that are in range will be reported as expected.
ca_es: Per a usuaris, això afecta el límit del GID primari. L'usuari no es retornarà a l'NSS si l'UID o el GID primari és fora de l'interval. Per als membres dels grups secundaris, els que estan dins l'interval es comunicaran com s'esperava.

source: Default: 1 for min_id, 0 (no limit) for max_id
ca_es: Per defecte: 1 per a min_id, 0 (sense límit) per a max_id

source: enumerate (bool)
ca_es: enumerate (booleà)

source: Determines if a domain can be enumerated. This parameter can have one of the following values:
ca_es: Determina si un domini pot ser enumerat. Aquest paràmetre pot tenir un dels valors següents:

source: TRUE = Users and groups are enumerated
ca_es: TRUE = Els usuaris i grups s'enumeren

source: FALSE = No enumerations for this domain
ca_es: FALSE = Cap enumeració per a aquest domini

source: Default: FALSE
ca_es: Per defecte: FALSE

source: While the first enumeration is running, requests for the complete user or group lists may return no results until it completes.
ca_es: Mentre s'està executant la primera enumeració, les peticions de llistes completes d'usuaris o grups poden no retornar cap resultat fins que aquest finalitzi.

source: Further, enabling enumeration may increase the time necessary to detect network disconnection, as longer timeouts are required to ensure that enumeration lookups are completed successfully. For more information, refer to the man pages for the specific id_provider in use.
ca_es: A més a més, permetre l'enumeració pot augmentar el temps necessari detectar desconnexions de xarxa, ja que temps d'espera més llargs són necessaris per assegurar-se que les cerques de l'enumeració s'han completat amb èxit. Per a més informació, aneu a les pàgines de manual de l'id_provider específic en ús.

source: entry_cache_timeout (integer)
ca_es: entry_cache_timeout (Enter)

source: How many seconds should nss_sss consider entries valid before asking the backend again
ca_es: Quants segons l'nss_sss hauria de considerar les entrades vàlides abans de demanar al rerefons una altra vegada

source: Default: 5400
ca_es: Per defecte: 5400

source: Determines if user credentials are also cached in the local LDB cache
ca_es: Determina si les credencials d'usuari també són emmagatzemades en la memòria cau local de LDB

source: account_cache_expiration (integer)
ca_es: account_cache_expiration (Enter)

source: Number of days entries are left in cache after last successful login before being removed during a cleanup of the cache. 0 means keep forever. The value of this parameter must be greater than or equal to offline_credentials_expiration.
ca_es: Nombre de dies que les entrades es queden a la memòria cau després del darrer inici de sessió vàlid abans de ser eliminat durant una neteja de la memòria cau. 0 significa mantenir per sempre. El valor d'aquest paràmetre ha de ser superior o igual a offline_credentials_expiration.

source: Default: 0 (unlimited)
ca_es: Per defecte: 0 (sense límit)

source: id_provider (string)
ca_es: id_provider (cadena)

source: use_fully_qualified_names (bool)
ca_es: use_fully_qualified_names (booleà)

source: If set to TRUE, all requests to this domain must use fully qualified names. For example, if used in LOCAL domain that contains a "test" user, <command>getent passwd test</command> wouldn't find the user while <command>getent passwd test@LOCAL</command> would.
ca_es: Si s'estableix a TRUE, totes les peticions a aquest domini han d'utilitzar noms de domini qualificats. Per exemples, si s'utilitza a un domini LOCAL que conté un usuari "test", <command>getent passwd test</command> no trobaria l'usuari mentre que <command>getent passwd test@LOCAL</command> si.

source: auth_provider (string)
ca_es: auth_provider (cadena)

source: The authentication provider used for the domain. Supported auth providers are:
ca_es: El proveïdor d'autenticació utilitzat per al domini. Els proveïdors d'autenticació suportats són:

source: <quote>ldap</quote> for native LDAP authentication. See <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring LDAP.
ca_es: <quote>ldap</quote> per autenticació nativa LDAP. Vegeu <citerefentry><refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum></citerefentry> per a més informació sobre configuració d'LDAP.

source: <quote>krb5</quote> for Kerberos authentication. See <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring Kerberos.
ca_es: <quote>krb5</quote> per a l'autenticació Kerberos. Vegeu <citerefentry><refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum></citerefentry> per a més informació sobre configurar Kerberos.

source: <quote>proxy</quote> for relaying authentication to some other PAM target.
ca_es: <quote>proxy</quote> per a la autenticació re-enviada a algun altre objectiu de PAM.

source: <quote>none</quote> disables authentication explicitly.
ca_es: <quote>none</quote> impossibilita l'autenticació explícitament.

source: Default: <quote>id_provider</quote> is used if it is set and can handle authentication requests.
ca_es: Per defecte: <quote>id_provider</quote> s'utilitza si s'ha establert i pot gestionar les sol·licituds d'autenticació.

source: access_provider (string)
ca_es: access_provider (cadena)

source: The access control provider used for the domain. There are two built-in access providers (in addition to any included in installed backends) Internal special providers are:
ca_es: El proveïdor d'accés de control utilitzat per al domini. Hi ha dos proveïdors d'accés incorporats (a més de qualsevol dels rerefons instal·lats) Els proveïdors especials interns són:

source: <quote>deny</quote> always deny access.
ca_es: <quote>deny</quote> sempre denega l'accés.

source: <quote>simple</quote> access control based on access or deny lists. See <citerefentry> <refentrytitle>sssd-simple</refentrytitle> <manvolnum>5</manvolnum></citerefentry> for more information on configuring the simple access module.
ca_es: <quote>simple</quote> control d'accés basat en llistes d'acceptació o denegació. Vegeu <citerefentry><refentrytitle>sssd-simple</refentrytitle> <manvolnum>5</manvolnum></citerefentry> per a més informació sobre la configuració del mòdul d'accés simple.

source: Default: <quote>permit</quote>
ca_es: Per defecte: <quote>permit</quote>

source: The provider which should handle change password operations for the domain. Supported change password providers are:
ca_es: El proveïdor que hauria de gestionar les operacions de canvi contrasenya per al domini. Els proveïdors de canvi de contrasenya compatibles són:

source: <quote>ldap</quote> to change a password stored in a LDAP server. See <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring LDAP.
ca_es: <quote>ldap</quote> per canviar una contrasenya emmagatzemada en un servidor LDAP. Vegeu <citerefentry><refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum></citerefentry> per a més informació sobre configuració d'LDAP.

source: <quote>krb5</quote> to change the Kerberos password. See <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring Kerberos.
ca_es: <quote>krb5</quote> per canviar la contrasenya Kerberos. Vegeu <citerefentry><refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum></citerefentry> per a més informació sobre configurar Kerberos.

source: <quote>proxy</quote> for relaying password changes to some other PAM target.
ca_es: <quote>proxy</quote> per al canvi de contrasenya re-enviat a algun altre objectiu de PAM.

source: <quote>none</quote> disallows password changes explicitly.
ca_es: <quote>none</quote> rebutja els canvis de contrasenya explícitament.

source: Default: <quote>auth_provider</quote> is used if it is set and can handle change password requests.
ca_es: Per defecte: <quote>auth_provider</quote> s'utilitza si s'ha establert i pot gestionar peticions de canvi de contrasenya.

source: Default: <quote>(?P&lt;name&gt;[^@]+)@?(?P&lt;domain&gt;[^@]*$)</quote> which translates to "the name is everything up to the <quote>@</quote> sign, the domain everything after that"
ca_es: Per defecte: <quote>(?P&lt;nom&gt;[^@]+)@?(?P&lt;domini&gt;[^@]*$)</quote> que es tradueix per "el nom és qualsevol cosa fins el símbol <quote>@</quote> , el domini tot el que ve després"

source: PLEASE NOTE ALSO: older version of libpcre only support the Python syntax (?P&lt;name&gt;) to label subpatterns.
ca_es: ATENCIÓ SI US PLAU: una versió més antiga de libpcre només suporta la sintaxi Python (?P &lt;name&gt;) a l'etiqueta subpatterns.

source: Default: <quote>%1$s@%2$s</quote>.
ca_es: Per defecte: <quote>%1$s@%2$s</quote>.

source: lookup_family_order (string)
ca_es: lookup_family_order (cadena)

source: Provides the ability to select preferred address family to use when performing DNS lookups.
ca_es: Proporciona la capacitat de seleccionar la família d'adreces preferida en realitzar cerques de DNS.

source: Supported values:
ca_es: Valors admesos:

source: ipv4_first: Try looking up IPv4 address, if that fails, try IPv6
ca_es: ipv4_first: Intenta resoldre l'adreça IPv4, si falla, intenta IPv6

source: ipv4_only: Only attempt to resolve hostnames to IPv4 addresses.
ca_es: ipv4_only: Intenta resoldre només noms màquina a adreces IPv4.

source: ipv6_first: Try looking up IPv6 address, if that fails, try IPv4
ca_es: ipv6_first: Intenta resoldre l'adreça IPv6, si falla, intenta IPv4

source: ipv6_only: Only attempt to resolve hostnames to IPv6 addresses.
ca_es: ipv6_only: Intenta resoldre només noms màquina a adreces IPv6.

source: Default: ipv4_first
ca_es: Per defecte: ipv4_first

source: dns_resolver_timeout (integer)
ca_es: dns_resolver_timeout (enter)

source: Defines the amount of time (in seconds) to wait for a reply from the DNS resolver before assuming that it is unreachable. If this timeout is reached, the domain will continue to operate in offline mode.
ca_es: Defineix la quantitat de temps (en segons) per esperar per una resposta de la resolució de DNS abans d'assumir que és inaccessible. Si s'arriba a aquest temps d'espera, el domini seguirà operant en el mode fora de línia.

source: Default: 6
ca_es: Per defecte: 6

source: dns_discovery_domain (string)
ca_es: dns_discovery_domain (cadena)

source: If service discovery is used in the back end, specifies the domain part of the service discovery DNS query.
ca_es: Si el servei de descobriment s'utilitza en el rerefons, especifica la part del domini de la consulta DNS del servei de descobriment.

source: Default: Use the domain part of machine's hostname
ca_es: Per defecte: Utilitza la part del domini del nom de màquina

source: These configuration options can be present in a domain configuration section, that is, in a section called <quote>[domain/<replaceable>NAME</replaceable>]</quote> <placeholder type="variablelist" id="0"/>
ca_es: Aquestes opcions de configuració poden ser presents a una secció de configuració de domini anomenada <quote>[domain/<replaceable>NAME</replaceable>]</quote> <placeholder type="variablelist" id="0"/>

source: proxy_pam_target (string)
ca_es: proxy_pam_target (cadena)

source: The proxy target PAM proxies to.
ca_es: El servidor intermediari on re-envia PAM.

source: Default: not set by default, you have to take an existing pam configuration or create a new one and add the service name here.
ca_es: Per defecte: No està establit per defecte, heu de prendre una configuració de pam existent o crear-ne una de nova i afegir aquí el nom del servei.

source: proxy_lib_name (string)
ca_es: proxy_lib_name (cadena)
